[
  {
    "Title": "First",
    "Date": "May 7, 2015",
    "Content": "I haven't really anything to write about yet."
  }
  {
    "Title": "Visual Basic Cost Me a Job",
    "Date": "July 2, 2015",
    "Content": "Last month I applied to a job as a .NET developer at a Series-B startup. Cool company, cool product, and as a C# .NET developer I felt I was a pretty cool dude for the job. That is, until I had a chat with the head of engineering in my second round. \"No\", he said. \"We're not a C# house. We're using Visual Basic\". <br> Oh bother. I don't want to do Visual Basic. Not now, not ever. I'm usually very open minded about what technologies I use, but this was a bit too much. Visual Basic is on it's deathbed. According to GitHut, VB is found in only .12% of all repositories barely outnumbering Assembly's 0.10%. But popularity isn't a good metric for quality - OCaml, Dart, and F# all rank below VB and are great in their own regards. The more telling is Microsoft's support, or lack thereof. Visual Basic was discontinued in, wait a second, 2008? 16-bit setup program? Dwindling support since Visual Studio 2002? Uh oh. The alarm bells were now superheated from their furious cadence. However, I accepted their invitation for an in-house interview, hoping someone there would tell me it was all a big mistake and their priority was on transitioning to a post-VB world. <br> During each of my interview rounds, I asked the same set of questions: what do you think of still being on VB, is there a roadmap towards a new technology, etc. To clarify, I wasn't supremely concerned with their current state. It's extremely hard to get rid of legacy technology (and technical debt, for that matter). What I was concerned about was direction. And each answer was more grim than the last. There was almost no impetus on moving off - a scary parallel with my current company's reluctance to move off Silverlight. I knew I should have kept my mouth shut but I couldn't. Unsurprisingly, I didn't receive an offer. Fortunately, the recruiter there was very kind - he was willing to discuss their decision with me. They said my coding skills were good but my vocal displeasure of VB was the deciding factor. Ah. Oh well. Rejection stings, but at least I didn't mess up the whiteboard questions."
  }
]
