[
  {
      "Name": "This Website",
      "Description": "A simple website created with the MEAN stack. I approached this project primarily as a learning exercise, which meant making some inconveinent choices. I chose to use 'Pure' implementations of technologies, so that meant pure JavaScript, HTML, and CSS. Scaffolding is cheating, so Yeoman was out (although I was inspired by the directory structure of Angular-Fullstack). While still not fully complete, I'm very happy with the results. I've learned a great deal, and feel much more confident doing web development.",
      "Link": "https://github.com/johnBartos/Website"
  },
  {
      "Name": "Radio Free Twitch",
      "Description": "Radio Free Twitch is a website where you can listen to just the audio of any Twitch.tv stream. The idea popped into my head the moment I woke up on my 23rd birthday; I had The International 5 playing off my car stereo earlier that week, and was annoyed that I had to waste all that power and bandwith for video I wasn't even watching. So I created a neat solution using Node.js streams that fetches the audio-only portion of a Twitch stream. Unfortunately, this project led to the realization that Flash is alive and well in the streaming ecosystem. The reason being is because nobody has ursurped it yet. While there are several competing standards for HTTP streaming, few browers actually support them - Twitch uses Apple's HLS protocol, but only Safari and Edge support it! While the current build work with Flash, I won't release until I can create a good solution using HTML5.",
      "Link": "https://github.com/johnBartos/RadioFreeTwitch"
  },
  {
    "Name": "Visual Service Monitor",
    "Description": "This is a little PowerShell script I developed to provide a visual readout of service status. I'm a strong believer in making your own software tools; they don't need to be super-serious production-ready scripts with unit tests and lengthy documentation, just little helpers to make your life easier. I got tired of constantly repeating the same get-service command to check if a service was installed correctly. So I came up with this in my spare time. It provides a real-time readout of the status of services, and color codes the states for instant assessment. It also dynamically resizes the list when a service is added or removed, so it's perfect to monitor the progress of our installation process. Check out the git page, it has a little .gif of it in action.",
    "Link": "https://github.com/johnBartos/VisualServiceMonitor"
  },
  {
    "Name": "Z-Probe Configurator",
    "Description": "When I first went to configure the auto-leveling Z-Probe for my 3D printer, I was lost in rings of configuration hell; never before had I seen so many #DEFINEs in one file. Even though my config-reading skills were keen, I still struggled to get everything just right - even with a guide. The thought of doing it again had kept me from upgrading my printer firmware, but I really wanted the new version of Marlin. So I decided to be lazy and create a script to do it for me! It originally started as a small hack-job that I planned on completing within a Saturday, but it evolved into this neat-looking GUI that took a week or so longer to complete. Even though it was a simple project I learned much on how to properly read and write files, and gained some slick Python skills. Furthermore, it has helped a small amount of people - I posted it to the 3D printing subreddit and got a few upvotes! It's the first piece of OSS I've released, and I'm quite pleased with it.",
    "Link": "https://github.com/johnBartos/ProbeConfigurator"
  },
  {
    "Name": "3D Printing",
    "Description": "I've always wanted to get into 3D printing since my trip to MakerFaire in 2013, but it was prohibitively expensive to my then-college self. But one day I got a job. A few more days after that I bought a RepRap. A Prusa i3v 8, to be exact. I even built it myself! It's a wonderful hobby for somebody who has way too much time on their hands; I'd sunk hundreds of hours into it before I got it printing nicely. But it's an extremely rewarding hobby which allows me to work with my hands (and not just fingertips). And I'm the envy of the office with my collection of little trinkets.",
    "Link":""
  }
]
